"""
    Объявить переменные name, age, city,
    присвоив им значения с помощью input().

    Вывести на экран текст типа:

    Max from Kiev
    He is 21
"""

name = input('Enter name: ')
age = int(input('Enter age: '))
city = input('Enter city: ')

print(name, 'from', city)
print('He is', age)

