"""
    Объявить переменные name, age, city,
    присвоив им значения с помощью input().

    Вывести на экран текст типа:

    Max from Kiev
    He is 21
"""
name = input('Enter name: ')
age = input('Enter age: ')
city = input('Enter city: ')

print(f'{name} from {city}\nHe is {age}')
