"""
    Арифметические операторы Python
    примеры в формате:
        инструкция    # результат
        print(2 + 2)  # 4
"""

# + (cложение чисел)
print(2 + 2)  # 4
print(2 + 1.5)  # 3.5
# print(10 + 'hello')  # нельзя складывать разные типы данных

# - (вычитание)
print(5 - 2)  # 3
print(-11.5 - 20)  # -31.5

# * (умножение)
print(-3 * 2)  # -6
print(5 * 0.5)  # 2.5

# / (деление)
print(6 / 2)  # 3.0
print(5 / 2)  # 2.5

# // (целочисленное деление)
print(5 // 2)  # 2
print(-16 // 5)  # -4

# % (деление по модулю, возвращает остаток от деления)
print(5 % 2)  # 1
print(16 % -5)  # -4

# ** (возведение в степень)
print(3 ** 3)  # 27
print(2 ** 2 ** 3)  # 256 (2 ** 2 ** 3 == 2 ** 8 == 256)
